app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-09-05 22:35:22.581129"], ["updated_at", "2019-09-05 22:35:22.581129"]]
---
  def create
    student = Student.create(student_params)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-09-05 22:35:22.612624"], ["id", 1]]
---
  def update
    student = Student.update(student_params)